---
kind: type
id: T:Autodesk.Revit.DB.ModelTextType
source: html/54498ab7-d9a1-320b-61c1-ee4b894464bb.htm
---
# Autodesk.Revit.DB.ModelTextType

A model text type symbol in the Autodesk Revit Family document.

## Syntax (C#)
```csharp
public class ModelTextType : ElementType
```